tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/2d/case/system/controlDict.transient
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application interFoam;
startFrom latestTime;
startTime 0;
stopAt endTime;
endTime 4;
deltaT 0.0001;
writeControl adjustableRunTime;
writeInterval 0.04;
purgeWrite 0;
writeFormat binary;
writePrecision 8;
writeCompression off;
timeFormat general;
timePrecision 8;
runTimeModifiable yes;
adjustTimeStep yes;
maxCo 0.35;
maxAlphaCo 0.20;
maxDeltaT 0.002;

functions
{
    probesPT
    {
        type probes;
        libs (sampling);
        fields (p p_rgh alpha.water U);
        probeLocations
        (
            (0.15 0 1.25)
            (0.08 0 0.445)
            (0.15 0 0.020)
        );
        writeControl adjustableRunTime;
        writeInterval 0.005;
    }
    boreAlpha
    {
        type probes;
        libs (sampling);
        fields (alpha.water);
        probeLocations
        (
            (-0.30 0 0.27) (-0.30 0 0.29) (-0.30 0 0.31) (-0.30 0 0.33) (-0.30 0 0.35)
            (-0.01 0 0.27) (-0.01 0 0.29) (-0.01 0 0.31) (-0.01 0 0.33) (-0.01 0 0.35)
        );
        writeControl adjustableRunTime;
        writeInterval 0.005;
    }
}
