tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/2d/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-5.8 -0.005 0.238)
    (0 -0.005 0.18)
    (0 0.005 0.18)
    (-5.8 0.005 0.238)
    (-5.8 -0.005 0.338)
    (0 -0.005 0.28)
    (0 0.005 0.28)
    (-5.8 0.005 0.338)
    (-5.8 -0.005 0.438)
    (0 -0.005 0.38)
    (0 0.005 0.38)
    (-5.8 0.005 0.438)
    (0 -0.005 0)
    (0.1215 -0.005 0)
    (0.1215 0.005 0)
    (0 0.005 0)
    (0 -0.005 0.07)
    (0.1215 -0.005 0.07)
    (0.1215 0.005 0.07)
    (0 0.005 0.07)
    (0.1215 -0.005 0.18)
    (0.1215 0.005 0.18)
    (0.1215 -0.005 0.28)
    (0.1215 0.005 0.28)
    (0.1215 -0.005 0.38)
    (0.1215 0.005 0.38)
    (0 -0.005 0.45)
    (0.1215 -0.005 0.45)
    (0.1215 0.005 0.45)
    (0 0.005 0.45)
    (0.1785 -0.005 0)
    (0.1785 0.005 0)
    (0.1785 -0.005 0.07)
    (0.1785 0.005 0.07)
    (0.1785 -0.005 0.18)
    (0.1785 0.005 0.18)
    (0.1785 -0.005 0.28)
    (0.1785 0.005 0.28)
    (0.1785 -0.005 0.38)
    (0.1785 0.005 0.38)
    (0.1785 -0.005 0.45)
    (0.1785 0.005 0.45)
    (0.3 -0.005 0)
    (0.3 0.005 0)
    (0.3 -0.005 0.07)
    (0.3 0.005 0.07)
    (0.3 -0.005 0.18)
    (0.3 0.005 0.18)
    (0.3 -0.005 0.28)
    (0.3 0.005 0.28)
    (0.3 -0.005 0.38)
    (0.3 0.005 0.38)
    (0.3 -0.005 0.45)
    (0.3 0.005 0.45)
    (6.25 -0.005 0)
    (6.25 0.005 0)
    (6.25 -0.005 0.07)
    (6.25 0.005 0.07)
    (6.25 -0.005 0.18)
    (6.25 0.005 0.18)
    (6.25 -0.005 0.28)
    (6.25 0.005 0.28)
    (0.1215 -0.005 1.67)
    (0.1785 -0.005 1.67)
    (0.1785 0.005 1.67)
    (0.1215 0.005 1.67)
    (6.25 -0.005 -0.369)
    (6.82 -0.005 -0.369)
    (6.82 0.005 -0.369)
    (6.25 0.005 -0.369)
    (6.82 -0.005 0)
    (6.82 0.005 0)
    (6.25 -0.005 0.031)
    (6.82 -0.005 0.031)
    (6.82 0.005 0.031)
    (6.25 0.005 0.031)
    (6.82 -0.005 0.07)
    (6.82 0.005 0.07)
    (6.82 -0.005 0.18)
    (6.82 0.005 0.18)
    (6.82 -0.005 0.28)
    (6.82 0.005 0.28)
    (6.25 -0.005 0.521)
    (6.82 -0.005 0.521)
    (6.82 0.005 0.521)
    (6.25 0.005 0.521)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (580 1 10) simpleGrading (1 1 1) // upstream_lower
    hex (4 5 6 7 8 9 10 11) (580 1 10) simpleGrading (1 1 1) // upstream_upper
    hex (12 13 14 15 16 17 18 19) (12 1 7) simpleGrading (1 1 1) // chamber_0_0
    hex (16 17 18 19 1 20 21 2) (12 1 11) simpleGrading (1 1 1) // chamber_0_1
    hex (1 20 21 2 5 22 23 6) (12 1 10) simpleGrading (1 1 1) // chamber_0_2
    hex (5 22 23 6 9 24 25 10) (12 1 10) simpleGrading (1 1 1) // chamber_0_3
    hex (9 24 25 10 26 27 28 29) (12 1 7) simpleGrading (1 1 1) // chamber_0_4
    hex (13 30 31 14 17 32 33 18) (6 1 7) simpleGrading (1 1 1) // chamber_1_0
    hex (17 32 33 18 20 34 35 21) (6 1 11) simpleGrading (1 1 1) // chamber_1_1
    hex (20 34 35 21 22 36 37 23) (6 1 10) simpleGrading (1 1 1) // chamber_1_2
    hex (22 36 37 23 24 38 39 25) (6 1 10) simpleGrading (1 1 1) // chamber_1_3
    hex (24 38 39 25 27 40 41 28) (6 1 7) simpleGrading (1 1 1) // chamber_1_4
    hex (30 42 43 31 32 44 45 33) (12 1 7) simpleGrading (1 1 1) // chamber_2_0
    hex (32 44 45 33 34 46 47 35) (12 1 11) simpleGrading (1 1 1) // chamber_2_1
    hex (34 46 47 35 36 48 49 37) (12 1 10) simpleGrading (1 1 1) // chamber_2_2
    hex (36 48 49 37 38 50 51 39) (12 1 10) simpleGrading (1 1 1) // chamber_2_3
    hex (38 50 51 39 40 52 53 41) (12 1 7) simpleGrading (1 1 1) // chamber_2_4
    hex (42 54 55 43 44 56 57 45) (595 1 7) simpleGrading (1 1 1) // downstream_0
    hex (44 56 57 45 46 58 59 47) (595 1 11) simpleGrading (1 1 1) // downstream_1
    hex (46 58 59 47 48 60 61 49) (595 1 10) simpleGrading (1 1 1) // downstream_2
    hex (27 40 41 28 62 63 64 65) (6 1 122) simpleGrading (1 1 1) // riser
    hex (66 67 68 69 54 70 71 55) (57 1 37) simpleGrading (1 1 1) // tank_0
    hex (54 70 71 55 72 73 74 75) (57 1 3) simpleGrading (1 1 1) // tank_1
    hex (72 73 74 75 56 76 77 57) (57 1 4) simpleGrading (1 1 1) // tank_2
    hex (56 76 77 57 58 78 79 59) (57 1 11) simpleGrading (1 1 1) // tank_3
    hex (58 78 79 59 60 80 81 61) (57 1 10) simpleGrading (1 1 1) // tank_4
    hex (60 80 81 61 82 83 84 85) (57 1 24) simpleGrading (1 1 1) // tank_5
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (4 7 11 8)
        );
    }
    tankAtmosphere
    {
        type patch;
        faces
        (
            (82 85 84 83)
        );
    }
    riserOutlet
    {
        type patch;
        faces
        (
            (62 65 64 63)
        );
    }
    weirOutlet
    {
        type patch;
        faces
        (
            (73 76 77 74)
            (76 78 79 77)
            (78 80 81 79)
            (80 83 84 81)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (8 11 10 9)
            (12 15 19 16)
            (12 13 14 15)
            (16 19 2 1)
            (9 10 29 26)
            (26 29 28 27)
            (13 30 31 14)
            (30 42 43 31)
            (48 50 51 49)
            (50 52 53 51)
            (40 41 53 52)
            (54 56 57 55)
            (42 54 55 43)
            (48 49 61 60)
            (27 28 65 62)
            (40 63 64 41)
            (66 69 55 54)
            (67 70 71 68)
            (66 67 68 69)
            (54 55 75 72)
            (70 73 74 71)
            (72 75 57 56)
            (60 61 85 82)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
            (4 8 9 5)
            (7 6 10 11)
            (12 16 17 13)
            (15 14 18 19)
            (16 1 20 17)
            (19 18 21 2)
            (1 5 22 20)
            (2 21 23 6)
            (5 9 24 22)
            (6 23 25 10)
            (9 26 27 24)
            (10 25 28 29)
            (13 17 32 30)
            (14 31 33 18)
            (17 20 34 32)
            (18 33 35 21)
            (20 22 36 34)
            (21 35 37 23)
            (22 24 38 36)
            (23 37 39 25)
            (24 27 40 38)
            (25 39 41 28)
            (30 32 44 42)
            (31 43 45 33)
            (32 34 46 44)
            (33 45 47 35)
            (34 36 48 46)
            (35 47 49 37)
            (36 38 50 48)
            (37 49 51 39)
            (38 40 52 50)
            (39 51 53 41)
            (42 44 56 54)
            (43 55 57 45)
            (44 46 58 56)
            (45 57 59 47)
            (46 48 60 58)
            (47 59 61 49)
            (27 62 63 40)
            (28 41 64 65)
            (66 54 70 67)
            (69 68 71 55)
            (54 72 73 70)
            (55 71 74 75)
            (72 56 76 73)
            (75 74 77 57)
            (56 58 78 76)
            (57 77 79 59)
            (58 60 80 78)
            (59 79 81 61)
            (60 82 83 80)
            (61 81 84 85)
        );
    }
);

mergePatchPairs
(
);
