tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/2d/case/constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

dimensions [0 1 -2 0 0 0 0];
value (0 0 -9.81);
