tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/2d/case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

phases (water air);
water { transportModel Newtonian; nu 1e-06; rho 998.2; }
air   { transportModel Newtonian; nu 1.48e-05; rho 1.2; }
sigma 0.072;
