tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/2d/case/0.orig/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;

boundaryField
{
    inlet { type fixedFluxPressure; value uniform 0; }
    tankAtmosphere { type prghTotalPressure; p0 uniform 0; value uniform 0; }
    riserOutlet    { type prghTotalPressure; p0 uniform 0; value uniform 0; }
    weirOutlet     { type prghTotalPressure; p0 uniform 0; value uniform 0; }
    walls          { type fixedFluxPressure; value uniform 0; }
    frontAndBack
    {
        type empty;
    }
}
